biletbank-updatepassengers/BILETBANK API REQUESTS - V2 BrandedFareItemId - RT/Makeprebooking request

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:trev="http://schemas.datacontract.org/2004/07/Trevoo.WS.Entities.Base" xmlns:trev1="http://schemas.datacontract.org/2004/07/Trevoo.WS.IO.Shopping" xmlns:trev2="http://schemas.datacontract.org/2004/07/Trevoo.WS.Entities.Transfer" xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
	<soapenv:Header/>
	<soapenv:Body>
		<tem:MakePrebooking>
			<tem:request>
				<trev:AuthenticationHeader>
					<trev:SessionId>7208632</trev:SessionId>
					<trev:SessionToken>e4586ab3-3c3d-4500-969c-4905f0315d2a</trev:SessionToken>
				</trev:AuthenticationHeader>
				<trev:ExtraParamList>
					<trev:ExtendedData>
						<trev:Name>IntendedShoppingFileId</trev:Name>
						<trev:Type>True</trev:Type>
						<trev:Value>f0ae7e4c-9ed1-44cb-a904-22cd88e00323</trev:Value>
					</trev:ExtendedData>
					<trev:ExtendedData>
						<trev:Name>DoReservation</trev:Name>
						<trev:Type>true</trev:Type>
						<trev:Value>true</trev:Value>
					</trev:ExtendedData>
				</trev:ExtraParamList>
				<trev1:Form>
					<trev1:Branded>
						<trev1:IO_Air_Branded_Form>
							<trev1:BrandedFareItemId>74dab017-cfbd-4546-adc8-135a21a84d68</trev1:BrandedFareItemId>
							<trev1:ProductId>f0e4870b-bb61-4930-a7fa-7daf756811ac</trev1:ProductId>
						</trev1:IO_Air_Branded_Form>
						<trev1:IO_Air_Branded_Form>
							<trev1:BrandedFareItemId>f4c0f957-628c-4a66-a7a0-86a55ffb2d94</trev1:BrandedFareItemId>
							<trev1:ProductId>f0e4870b-bb61-4930-a7fa-7daf756811ac</trev1:ProductId>
						</trev1:IO_Air_Branded_Form>
					</trev1:Branded>
					<trev1:CIPRequest/>
					<trev1:ExtraForm>
						<trev1:SelectedServiceFee>0</trev1:SelectedServiceFee>
					</trev1:ExtraForm>
					<trev1:CIPRequest/>
					<trev1:ProductIds>
						<arr:guid>f0e4870b-bb61-4930-a7fa-7daf756811ac</arr:guid>
					</trev1:ProductIds>
				</trev1:Form>
			</tem:request>
		</tem:MakePrebooking>
	</soapenv:Body>
</soapenv:Envelope>